saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
static void set_status(enum modem_step step, enum step_state state, int err)
{
	atomic_set(&g_status[step].state, state);
	atomic_set(&g_status[step].err, err);
}

/* Replaces the old pdn.h callback API (pdn_default_ctx_cb_reg()/enum
 * pdn_event), removed in NCS v3.4.1 - PDN events now arrive as LTE_LC_EVT_PDN
 * through the same lte_lc event handler as everything else. */
static void lte_lc_evt_handler(const struct lte_lc_evt *const evt)
{
	if (evt->type != LTE_LC_EVT_PDN || evt->pdn.cid != 0) {
		return;
	}

	switch (evt->pdn.type) {
	case LTE_LC_EVT_PDN_ACTIVATED:
		atomic_set(&g_pdn_up, 1);
		k_sem_give(&pdn_activated_sem);
		break;
	case LTE_LC_EVT_PDN_DEACTIVATED:
	case LTE_LC_EVT_PDN_NETWORK_DETACH:
	case LTE_LC_EVT_PDN_CTX_DESTROYED:
		atomic_set(&g_pdn_up, 0);
		warn(TAG, "pdn event %d on default context", evt->pdn.type);
		break;
	case LTE_LC_EVT_PDN_ESM_ERROR:
		warn(TAG, "pdn esm error: %s", lte_lc_pdn_esm_strerror(evt->pdn.esm_err));
		break;
	default:
		break;
	}
}

/* modem_key_mgmt_write() (and friends) fail while the LTE link is active, so
 * this can only run during the offline window step_sim_check() opens up
 * before ever calling lte_lc_connect(). */
static int cert_provision(void)
{
	bool exists;
	int err = modem_key_mgmt_exists(TLS_SEC_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN, &exists);

	if (err) {
		return err;
	}

	if (exists) {
		int mismatch = modem_key_mgmt_cmp(TLS_SEC_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
						   ca_cert, sizeof(ca_cert));

		if (!mismatch) {
			return 0;
		}

		err = modem_key_mgmt_delete(TLS_SEC_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN);
		if (err) {
			return err;
		}
	}

	return modem_key_mgmt_write(TLS_SEC_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN, ca_cert,
				     sizeof(ca_cert));
}

/* SIM readiness can only be queried once the modem is in full function mode
 * (CFUN=1) - at CFUN=4 (used below for cert provisioning) the UICC interface
 * isn't up yet and AT+CPIN? reliably comes back with a bare ERROR rather
 * than a real "SIM missing"/"PIN needed" answer. Even after CFUN=1, an `OK`
 * to that command only means the modem accepted it - the SIM's own power-up
 * and ATR aren't instantaneous, so this gives it SIM_SETTLE_DELAY_MS before
 * the first attempt and keeps polling up to SIM_READY_TIMEOUT_MS. */
#define SIM_SETTLE_DELAY_MS  2000
#define SIM_READY_TIMEOUT_MS 15000
#define SIM_POLL_INTERVAL_MS 500

static int step_sim_check(void)
{
	int err = lte_lc_offline();

	if (err) {
		return err;
	}

	err = cert_provision();
	if (err) {
		return err;
	}

	err = lte_lc_normal();
	if (err) {
		return err;
	}

	/* Verbose CME errors, best effort - CFUN transitions reset this, so
	 * it has to be resent after every lte_lc_normal(), not just once. */
	(void)nrf_modem_at_printf("AT+CMEE=1");

	k_msleep(SIM_SETTLE_DELAY_MS);

	int64_t deadline = k_uptime_get() + SIM_READY_TIMEOUT_MS;
	char resp[64];

	while (true) {
		err = nrf_modem_at_cmd(resp, sizeof(resp), "AT+CPIN?");
		if (!err && strstr(resp, "READY")) {
			return 0;
		}

		if (k_uptime_get() >= deadline) {
			return err ? err : -EACCES;
		}

		k_msleep(SIM_POLL_INTERVAL_MS);
	}
}

/* The modem is already in CFUN=1 by this point (step_sim_check() switched it
 * there to query the SIM), so this just blocks until registered - which
 * also activates the default PDP context (cid 0) - lte_lc_evt_handler()
 * reports that activation via g_pdn_up/pdn_activated_sem. */
static int step_pdn_connect(void)
{
	int err = lte_lc_connect();

	if (err) {
		return err;
	}

	if (atomic_get(&g_pdn_up)) {
		return 0;
	}

	return k_sem_take(&pdn_activated_sem, K_SECONDS(10));
}

/* Returns an open, TLS-connected socket fd (offloaded to the modem, hence
 * IPPROTO_TLS_1_2 rather than a host-side TLS stack) on success, or a
 * negative errno. Connects to config_store's "cloud_host" if set (see
 * get_cloud_host()), else MODEM_TASK_HOSTNAME - note the provisioned root CA
 * (see ca_cert above) only actually validates the latter, so pointing at an
 * arbitrary other host will fail the TLS handshake, same as nodem-esp32's
 * own "#host" (it doesn't special-case the CA per host either). */
static int step_tls_connect(void)
{
	get_cloud_host(g_cloud_host, sizeof(g_cloud_host));

	struct addrinfo hints = {
		.ai_family = AF_UNSPEC,
		.ai_socktype = SOCK_STREAM,
	};
	struct addrinfo *res;

	int err = getaddrinfo(g_cloud_host, MODEM_TASK_PORT, &hints, &res);

	if (err) {
		return -EIO;
	}

	int fd = socket(res->ai_family, SOCK_STREAM, IPPROTO_TLS_1_2);

	if (fd < 0) {
		err = -errno;
		freeaddrinfo(res);
		return err;
	}

	sec_tag_t sec_tag_list[] = { TLS_SEC_TAG };
	int verify = TLS_PEER_VERIFY_REQUIRED;

	err = setsockopt(fd, SOL_TLS, TLS_PEER_VERIFY, &verify, sizeof(verify));
	if (!err) {
		err = setsockopt(fd, SOL_TLS, TLS_SEC_TAG_LIST, sec_tag_list,
				  sizeof(sec_tag_list));
	}
	if (!err) {
		err = setsockopt(fd, SOL_TLS, TLS_HOSTNAME, g_cloud_host, strlen(g_cloud_host));
	}
	if (!err) {
		err = connect(fd, res->ai_addr, res->ai_addrlen);
	}

	freeaddrinfo(res);

	if (err) {
		err = -errno;
		close(fd);
		return err;
	}

	return fd;
}

/* Cloud device registration - same backend and wire protocol as
 * nodem-esp32's websocket.rs (ensure_device_credentials()/register_device()):
 * "#reg,<code>,<mac_or_imei>,<name>" request, "#id,<id>,<secret>,<name>"
 * response (confirmed against a live response - a previous version of this
 * comment claimed the response was only two fields, which was actually an
 * artifact of REG_RESP_BUF_SIZE being too small to receive the body at all,
 * not the real response shape). The device id, auth secret (needed for any
 * authenticated call to the cloud from here on), and a server-verified
 * device name (which may differ from the name submitted above, e.g.
 * de-duplicated or normalized) all get persisted to complete the
 * registration permanently - under the same NVS key names nodem-esp32 uses
 * (NVS_KEY_DEVICE_ID/NVS_KEY_DEVICE_SECRET/NVS_KEY_DEVICE_NAME/
 * NVS_KEY_REGISTRATION_CODE in its websocket.rs), so
 * "device_id"/"device_secret"/"device_name"/"reg_code" here, not names of
 * our own invention. control.rs's "#reg" command (over UART) is what
 * provisions "reg_code"/"device_name" into config_store; this just acts on
 * them whenever they're pending - a value of "" (or REG_CODE_REJECTED)
 * means nothing to do, which is the common case and cheap to check. */
#define REG_CODE_LEN            6
#define REG_CODE_REJECTED       "0"
#define REG_NAME_MIN_LEN        3
#define REG_NAME_MAX_LEN        64
#define REG_IMEI_LEN            20
#define REG_ID_LEN              64
#define REG_SECRET_LEN          64
#define REG_VERIFIED_NAME_LEN   128

