saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
	close(fd);
	atomic_set(&g_tls_fd, -1);

	if (err) {
		error(TAG, "device registration failed, err %d", err);
		config_set_str("reg_code", REG_CODE_REJECTED);
	}

	return 0;
}

/* The device's live channel to the cloud once registered - same backend and
 * auth scheme as nodem-esp32's websocket_task(): connects to "/ws/device"
 * with the device id/secret from registration sent as "X-Device-Id"/
 * "X-Device-Secret" headers (there, a single EspWebSocketClientConfig::headers
 * string; Zephyr's websocket_request wants one array entry per header
 * instead, each already including its own "\r\n").
 *
 * Layers on top of the raw TLS socket step_tls_connect() already opened
 * (`fd`, still tracked by g_tls_fd) rather than opening a second connection
 * - websocket_connect() returns a *different* id (the "websocket socket")
 * used for websocket_send_msg()/websocket_recv_msg(), but `fd` itself must
 * stay open and untouched for as long as the websocket does (see its doc
 * comment) - both need to be closed on the way out, and neither
 * websocket_disconnect() nor closing the websocket id closes the other, so
 * that's left to modem_task() to do explicitly once done. */
static int step_websocket_connect(void)
{
	int fd = (int)atomic_get(&g_tls_fd);

	if (fd < 0) {
		return -ENOTCONN;
	}

	char id[REG_ID_LEN];
	char secret[REG_SECRET_LEN];

	config_get_str("device_id", id, sizeof(id), "");
	config_get_str("device_secret", secret, sizeof(secret), "");

	static char id_header[16 + REG_ID_LEN];
	static char secret_header[20 + REG_SECRET_LEN];

	snprintf(id_header, sizeof(id_header), "X-Device-Id: %s\r\n", id);
	snprintf(secret_header, sizeof(secret_header), "X-Device-Secret: %s\r\n", secret);

	const char *headers[] = { id_header, secret_header, NULL };
	static uint8_t tmp_buf[512];

	struct websocket_request req = {
		.host = g_cloud_host,
		.url = "/ws/device",
		.optional_headers = headers,
		.tmp_buf = tmp_buf,
		.tmp_buf_len = sizeof(tmp_buf),
	};

	int ws_sock = websocket_connect(fd, &req, 10 * MSEC_PER_SEC, NULL);

	if (ws_sock < 0) {
		/* websocket_connect() failing leaves `fd` open (see the
		 * sample this is modeled on) - it's ours to close, same as
		 * step_tls_connect() failing partway through would be. */
		close(fd);
		atomic_set(&g_tls_fd, -1);
		return ws_sock;
	}

	return ws_sock;
}

/* Matches nodem-esp32's websocket_task() inner loop: a "ping,<seconds>" text
 * frame every MODEM_WS_PING_PERIOD_MS as an application-level keepalive
 * (catches a link that looks "connected" but has silently stopped passing
 * data, which a lower-level TCP/TLS keepalive wouldn't), plus pumping
 * ws_tx_ring/ws_rx_ring (see their doc comment) so nodem_task.c's
 * nodem_process_ws() - running on a different thread - can treat the
 * websocket as just another command transport, the same way it already
 * does uart_task.c's UART.
 *
 * Runs until the connection needs to be re-established for any reason,
 * returning which step modem_task() should resume from - MODEM_STEP_PDN if
 * the PDN link itself dropped, MODEM_STEP_TLS otherwise (a fresh
 * registration code taking priority counts as "otherwise" too: it doesn't
 * get special-cased into MODEM_STEP_REGISTER here, since modem_task()
 * already routes through MODEM_STEP_TLS first regardless and decides from
 * there - see its doc comment). Does not itself close `ws_sock`/g_tls_fd;
 * modem_task() does that once this returns, same reasoning as
 * step_websocket_connect() leaving that to its own caller. */
#define MODEM_WS_PING_PERIOD_MS  10000
#define MODEM_WS_RECV_TIMEOUT_MS 200
/* Bigger than a typical command/reply, so a large "pkg" transfer's data
 * moves in fewer, larger websocket_recv_msg() calls rather than being
 * artificially chopped into many small ones each paying its own call
 * overhead - matched to MODEM_WS_RING_SIZE's own reasoning above. */
#define MODEM_WS_RECV_BUF_SIZE   1024

static enum modem_step websocket_supervise(int ws_sock)
{
	int64_t last_ping = k_uptime_get();

	while (true) {
		if (registration_pending()) {
			info(TAG, "registration code pending, disconnecting websocket");
			return MODEM_STEP_TLS;
		}

		if (!atomic_get(&g_pdn_up)) {
			warn(TAG, "pdn connection lost, reconnecting");
			set_status(MODEM_STEP_PDN, STEP_PENDING, 0);
			return MODEM_STEP_PDN;
		}

		if (k_uptime_get() - last_ping >= MODEM_WS_PING_PERIOD_MS) {
			last_ping = k_uptime_get();

			char ping[32];
			int ping_len = snprintf(ping, sizeof(ping), "ping,%lld",
						 (long long)(k_uptime_get() / MSEC_PER_SEC));

			if (websocket_send_msg(ws_sock, (const uint8_t *)ping, ping_len,
						WEBSOCKET_OPCODE_DATA_TEXT, true, true,
						MSEC_PER_SEC) < 0) {
				warn(TAG, "websocket ping failed, reconnecting");
				return MODEM_STEP_TLS;
			}
		}

		/* Whatever nodem_process_ws() (nodem_task.c) queued via
		 * modem_ws_write() since this last ran - drained here, not
		 * sent directly from nodem_task()'s own thread, since
		 * websocket_send_msg() touches ws_sock, which only this
		 * thread may do (see ws_tx_ring's doc comment above). */
		static uint8_t tx_buf[MODEM_WS_RECV_BUF_SIZE];
		size_t tx_len = ring_buf_get(&ws_tx_ring, tx_buf, sizeof(tx_buf));

		if (tx_len > 0) {
			if (websocket_send_msg(ws_sock, tx_buf, tx_len, WEBSOCKET_OPCODE_DATA_TEXT,
						true, true, MSEC_PER_SEC) < 0) {
				warn(TAG, "websocket send failed, reconnecting");
				return MODEM_STEP_TLS;
			}
		}

		static uint8_t rx_buf[MODEM_WS_RECV_BUF_SIZE];
		uint32_t message_type = 0;
		uint64_t remaining = 0;
		int n = websocket_recv_msg(ws_sock, rx_buf, sizeof(rx_buf), &message_type,
					    &remaining, MODEM_WS_RECV_TIMEOUT_MS);

		if (n == -EAGAIN) {
			continue;
		}
		if (n < 0) {
			warn(TAG, "websocket connection lost, err %d, reconnecting", n);
			return MODEM_STEP_TLS;
		}

		uint32_t queued = ring_buf_put(&ws_rx_ring, rx_buf, (size_t)n);

		if (queued > 0) {
			/* Wakes nodem_task immediately rather than leaving
			 * this data to wait for its next render deadline -
			 * see nodem_task_notify_rx()'s doc comment. */
			nodem_task_notify_rx();
		}

		if (queued != (uint32_t)n) {
			/* Ring buffer full (or too full for all of it) - drop
			 * the remainder rather than block this thread (which
			 * also owns the ping/reconnect logic above);
			 * nodem_process_ws() isn't keeping up. Same tradeoff
			 * uart_isr() makes for the same reason. Logs only the
			 * actual shortfall, not all of `n` - ring_buf_put()
			 * still queues however much did fit. */
			warn(TAG, "ws_rx_ring full, dropping %u of %d bytes",
			     (unsigned)((uint32_t)n - queued), n);
		}
	}
}

