saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
#define MODEM_RETRY_DELAY_MS 3000
#define MODEM_POLL_PERIOD_MS 1000

static void modem_task(void *p1, void *p2, void *p3)
{
	ARG_UNUSED(p1);
	ARG_UNUSED(p2);
	ARG_UNUSED(p3);

	lte_lc_register_handler(lte_lc_evt_handler);

	enum modem_step step = MODEM_STEP_INIT;

	while (true) {
		set_status(step, STEP_RUNNING, 0);

		int err;
		int fd = -1;
		int ws_sock = -1;

		switch (step) {
		case MODEM_STEP_INIT:
			err = nrf_modem_lib_init();
			break;
		case MODEM_STEP_SIM:
			err = step_sim_check();
			break;
		case MODEM_STEP_PDN:
			err = step_pdn_connect();
			break;
		case MODEM_STEP_TLS:
			fd = step_tls_connect();
			err = fd < 0 ? fd : 0;
			break;
		case MODEM_STEP_REGISTER:
			err = step_register();
			break;
		case MODEM_STEP_WEBSOCKET:
			ws_sock = step_websocket_connect();
			err = ws_sock < 0 ? ws_sock : 0;
			break;
		default:
			err = 0;
			break;
		}

		if (err) {
			error(TAG, "%s failed, err %d", step_name[step], err);
			set_status(step, STEP_ERROR, err);
			k_msleep(MODEM_RETRY_DELAY_MS);
			/* Unlike every other step, a failed
			 * step_websocket_connect() always leaves g_tls_fd
			 * closed and reset to -1 (see its own doc comment) -
			 * simply retrying MODEM_STEP_WEBSOCKET in place would
			 * hit that stale -1 immediately (step_websocket_connect
			 * ()'s own "fd < 0" guard, -ENOTCONN) forever, never
			 * recovering on its own. Go back through
			 * MODEM_STEP_TLS first to get a fresh fd instead. */
			if (step == MODEM_STEP_WEBSOCKET) {
				step = MODEM_STEP_TLS;
			}
			continue;
		}

		set_status(step, STEP_OK, 0);

		switch (step) {
		case MODEM_STEP_TLS:
			atomic_set(&g_tls_fd, fd);
			info(TAG, "tls connected, fd %d", fd);
			/* A fresh registration code always takes priority,
			 * even for an already-registered device (see
			 * step_register()'s doc comment on "(re)register") -
			 * otherwise this connection is for the device's
			 * already-registered live channel. Nothing else opens
			 * MODEM_STEP_TLS (see the MODEM_STEP_PDN case below),
			 * so one of the two is always true here. */
			step = registration_pending() ? MODEM_STEP_REGISTER : MODEM_STEP_WEBSOCKET;
			break;

		case MODEM_STEP_REGISTER:
			/* step_register() always closes the TLS connection
			 * it was given once it's done with it (see its doc
			 * comment) - nothing else uses this connection yet,
			 * so go back to idling at PDN rather than
			 * reconnecting TLS again for no reason. */
			set_status(MODEM_STEP_TLS, STEP_PENDING, 0);
			step = MODEM_STEP_PDN;
			break;

		case MODEM_STEP_WEBSOCKET: {
			atomic_set(&g_ws_sock, ws_sock);
			info(TAG, "websocket connected, sock %d", ws_sock);

			enum modem_step next = websocket_supervise(ws_sock);

			/* Neither websocket_disconnect() nor closing ws_sock
			 * closes the raw TLS socket it wraps (see
			 * step_websocket_connect()'s doc comment) - that's
			 * still whatever g_tls_fd was set to when
			 * MODEM_STEP_TLS last succeeded, read before clearing
			 * it below. */
			int raw_fd = (int)atomic_get(&g_tls_fd);

			websocket_disconnect(ws_sock);
			close(raw_fd);
			atomic_set(&g_ws_sock, -1);
			atomic_set(&g_tls_fd, -1);
			set_status(MODEM_STEP_WEBSOCKET, STEP_PENDING, 0);
			step = next;
			break;
		}

		case MODEM_STEP_PDN:
			/* Deliberately doesn't open TLS here - PDN (LTE
			 * attach) alone doesn't consume ongoing bandwidth, so
			 * it's kept up while idle, but TLS - and thus any
			 * bandwidth use - only happens when there's an actual
			 * reason to: an "#reg"-provisioned registration
			 * attempt, or (once registered) the device's live
			 * websocket channel to the cloud. */
			while (true) {
				k_msleep(MODEM_POLL_PERIOD_MS);

				if (!atomic_get(&g_pdn_up)) {
					warn(TAG, "pdn connection lost, reconnecting");
					set_status(MODEM_STEP_PDN, STEP_PENDING, 0);
					break;
				}

				if (registration_pending() || device_registered()) {
					info(TAG, "connecting");
					step = MODEM_STEP_TLS;
					break;
				}
			}
			break;

		default:
			step++;
			break;
		}
	}
}

static const char *state_name(enum step_state state)
{
	switch (state) {
	case STEP_PENDING:
		return "pending";
	case STEP_RUNNING:
		return "running";
	case STEP_OK:
		return "ok";
	case STEP_ERROR:
		return "error";
	default:
		return "?";
	}
}

size_t modem_status_format(char *buf, size_t buf_len)
{
	/* MODEM_STEP_REGISTER only runs during the connection cycle that
	 * consumes a fresh reg_code (see modem_task()'s MODEM_STEP_TLS case);
	 * once a device is already registered and reconnects with no new
	 * code, its g_status entry is never touched again and stays at its
	 * default STEP_PENDING forever even though registration is done and
	 * persisted - report it as STEP_OK in that case instead, same as
	 * step_effectively_ok() does for the on-device status overlay. */
	enum step_state reg_state = device_registered() ? STEP_OK
				   : atomic_get(&g_status[MODEM_STEP_REGISTER].state);
	int reg_err = device_registered() ? 0 : (int)atomic_get(&g_status[MODEM_STEP_REGISTER].err);

	int n = snprintf(buf, buf_len,
			  "init=%s(%d) sim=%s(%d) pdn=%s(%d) tls=%s(%d) reg=%s(%d) ws=%s(%d) "
			  "fd=%d wsock=%d",
			  state_name(atomic_get(&g_status[MODEM_STEP_INIT].state)),
			  (int)atomic_get(&g_status[MODEM_STEP_INIT].err),
			  state_name(atomic_get(&g_status[MODEM_STEP_SIM].state)),
			  (int)atomic_get(&g_status[MODEM_STEP_SIM].err),
			  state_name(atomic_get(&g_status[MODEM_STEP_PDN].state)),
			  (int)atomic_get(&g_status[MODEM_STEP_PDN].err),
			  state_name(atomic_get(&g_status[MODEM_STEP_TLS].state)),
			  (int)atomic_get(&g_status[MODEM_STEP_TLS].err),
			  state_name(reg_state),
			  reg_err,
			  state_name(atomic_get(&g_status[MODEM_STEP_WEBSOCKET].state)),
			  (int)atomic_get(&g_status[MODEM_STEP_WEBSOCKET].err),
			  (int)atomic_get(&g_tls_fd),
			  (int)atomic_get(&g_ws_sock));

	return n > 0 ? (size_t)n : 0;
}

#define MODEM_STATUS_PERIOD_MS 200 /* 5 Hz */

/* MODEM_STEP_REGISTER is a one-time bootstrap step: modem_task()'s
 * MODEM_STEP_TLS case only routes through it while registration_pending()
 * holds, going straight to MODEM_STEP_WEBSOCKET otherwise - so for a device
 * that's already registered (device_registered()), it never runs again on
 * any later connection cycle. Its g_status entry is left at its default
 * STEP_PENDING forever in that case, not STEP_OK, which would otherwise
 * make it look exactly like a stuck/blocking step to anything walking
 * g_status[] (modem_status_line() below, and modem_status_task()'s
 * "is everything up" check) even though there's genuinely nothing left to
 * do or report for it. */
static bool step_effectively_ok(enum modem_step step)
{
	if (step == MODEM_STEP_REGISTER && device_registered()) {
		return true;
	}

	return atomic_get(&g_status[step].state) == STEP_OK;
}

/* Formats one group's status into `buf` - the first (earliest, in `first`..
 * `last` order) step short of STEP_OK, plus its error code if it's actually
 * in STEP_ERROR (a "running"/"pending" state has no meaningful err value to
 * show), or "<group>: ok" if every step in the range already is. Used to
 * build modem_status_task()'s two-line display: one call each for the modem
 * side (INIT..PDN) and the cloud side (TLS..WEBSOCKET). */
static void modem_status_line(char *buf, size_t buf_len, const char *group, enum modem_step first,
			       enum modem_step last)
{
	for (enum modem_step step = first; step <= last; step++) {
		if (step_effectively_ok(step)) {
			continue;
		}

